---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetBoundaryLines
source: html/8c3aeea1-3ada-1156-f623-598b5effdd6e.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetBoundaryLines Method

Gets boundary lines.

## Syntax (C#)
```csharp
public IList<CurveLoop> GetBoundaryLines()
```

## Returns
The boundary lines.